#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-api-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Api"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 5000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/api:14"
              + memory            = "1.5Gi"
              + name              = "api"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
              + env {
                  + name  = "PGUSER"
                  + value = "psqladmin"
                }
              + env {
                  + name  = "PGDATABASE"
                  + value = "postgres"
                }
              + env {
                  + name  = "PGPORT"
                  + value = "5432"
                }
              + env {
                  + name  = "PGPASSWORD"
                  + value = "p@ssw0rd!"
                }
            }
        }
    }

  # azurerm_container_app.client will be created
  + resource "azurerm_container_app" "client" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-client-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Client"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 3000
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/client:14"
              + memory            = "1.5Gi"
              + name              = "client"
            }
        }
    }

  # azurerm_container_app.nginx will be created
  + resource "azurerm_container_app" "nginx" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-nginx-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "NGinx"
        }

      + ingress {
          + allow_insecure_connections = true
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/nginx:14"
              + memory            = "1.5Gi"
              + name              = "nginx"
            }
        }
    }

  # azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-worker-fb-sbx-uks-5ff115e9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "sbx"
          + "managedby"   = "Terraform"
          + "pipeline"    = "Github Actions"
          + "service"     = "Worker"
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "index.docker.io/heathen1878/worker:14"
              + memory            = "2.0Gi"
              + name              = "worker"

              + env {
                  + name  = "REDIS_HOST"
                  + value = (known after apply)
                }
              + env {
                  + name  = "REDIS_PORT"
                  + value = "6379"
                }
            }
        }
    }

  # azurerm_container_app_environment.this must be replaced
-/+ resource "azurerm_container_app_environment" "this" {
      ~ custom_domain_verification_id               = "41C084045B053957F022857FFAE0B988908646EE8D456298D43469761C7FB37C" -> (known after apply)
      ~ default_domain                              = "livelytree-f4d3dfbc.uksouth.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      ~ id                                          = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-5ff115e9/providers/Microsoft.App/managedEnvironments/cae-fb-sbx-uks-5ff115e9" -> (known after apply)
      ~ infrastructure_resource_group_name          = "ME_cae-fb-sbx-uks-5ff115e9_rg-fb-sbx-uks-5ff115e9_uksouth" -> "rg-cae-infra-fb-sbx-uks-5ff115e9" # forces replacement
        name                                        = "cae-fb-sbx-uks-5ff115e9"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      ~ static_ip_address                           = "85.210.209.130" -> (known after apply)
        tags                                        = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Container App Environment"
        }
        # (8 unchanged attributes hidden)

      - workload_profile {
          - maximum_count         = 0 -> null
          - minimum_count         = 0 -> null
          - name                  = "Consumption" -> null
          - workload_profile_type = "Consumption" -> null
        }
      + workload_profile {
          + maximum_count         = 2
          + minimum_count         = 1
          + name                  = "Consumption"
          + workload_profile_type = "Consumption"
        }
    }

  # azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "redis-fb-sbx-uks-5ff115e9"
      + non_ssl_port_enabled          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-5ff115e9"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)

      + redis_configuration {
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
        }
    }

  # azurerm_subnet.cae will be updated in-place
  ~ resource "azurerm_subnet" "cae" {
        id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fb-sbx-uks-5ff115e9/subnets/cae"
        name                                           = "cae"
        # (11 unchanged attributes hidden)

      ~ delegation {
            name = "cae"

          ~ service_delegation {
              ~ actions = [
                  ~ "Microsoft.Network/virtualNetworks/subnets/join/action" -> "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.psql will be updated in-place
  ~ resource "azurerm_subnet" "psql" {
        id                                             = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-5ff115e9/providers/Microsoft.Network/virtualNetworks/vnet-fb-sbx-uks-5ff115e9/subnets/psql"
        name                                           = "psql"
        # (11 unchanged attributes hidden)

      ~ delegation {
            name = "psql"

          ~ service_delegation {
              ~ actions = [
                  ~ "Microsoft.Network/virtualNetworks/subnets/join/action" -> "Microsoft.Network/virtualNetworks/subnets/action",
                ]
                name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

Plan: 6 to add, 2 to change, 1 to destroy.

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure